Спортклуб/src/Documents/ЗаморозкаАбонемента/ЗаморозкаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаморозкаАбонемента</name>
  <attributes>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОканчания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Спортклуб/src/InformationRegisters/СостояниеАбонемента/СостояниеАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеАбонемента</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАбонемента</types>
    </type>
  </resources>
  <resources>
    <name>ОстатокПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноЗаморозок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/Enums/СтатусАбонемента/СтатусАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусАбонемента</name>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Закончился</name>
  </enumValues>
  <enumValues>
    <name>Заморожен</name>
  </enumValues>
</mdclass:Enum>

Спортклуб/src/Documents/ЗаморозкаАбонемента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    
        
        Если Не ПроверитьВозможностьЗаморозки() Тогда
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        ОбновитьСтатусАбонемента(Перечисления.СтатусАбонемента.Заморожен);
        
КонецПроцедуры



Функция ПроверитьВозможностьЗаморозки()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    СостояниеАбонемента.Статус КАК Статус,
    |    СостояниеАбонемента.ДоступноЗаморозок КАК ДоступноЗаморозок,
    |    СостояниеАбонемента.ДатаОкончания КАК ДатаОкончанияАбонемента
    |ИЗ
    |    РегистрСведений.СостояниеАбонемента КАК СостояниеАбонемента
    |ГДЕ
    |    СостояниеАбонемента.Абонемент = &Абонемент";
    
    Запрос.УстановитьПараметр("Абонемент", Абонемент);
    Результат = Запрос.Выполнить().Выбрать();
    
    Если НЕ Результат.Следующий() Тогда
        Сообщить("Абонемент не найден в регистре состояний");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.Статус <> Перечисления.СтатусАбонемента.Активен Тогда
        Сообщить("Заморозка возможна только для активных абонементов");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.ДоступноЗаморозок <= 0 Тогда
        Сообщить("Лимит заморозок исчерпан");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.ДатаОкончанияАбонемента <> Неопределено 
        И Результат.ДатаОкончанияАбонемента < ТекущаяДата() Тогда
		Сообщить("Абонемент уже закрыт");
        Возврат Ложь;
    КонецЕсли;
    Сообщить(ДатаОканчания);
    Сообщить(ДатаНачала);
    СрокЗаморозки = ДатаОканчания - ДатаНачала;
    Если СрокЗаморозки > 90 Тогда 
		Сообщить("Срок заморозки не может превышать 3 месяцев");
        Возврат Ложь;
    КонецЕсли;
    
    Возврат Истина;
    
КонецФункции


Процедура ОбновитьСтатусАбонемента(НовыйСтатус)
    
    НаборЗаписей = РегистрыСведений.СостояниеАбонемента.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Абонемент.Установить(Абонемент);
    НаборЗаписей.Прочитать();
    
    Если НаборЗаписей.Количество() = 0 Тогда
        Запись = НаборЗаписей.Добавить();
        Запись.Абонемент = Абонемент;
    Иначе
        Запись = НаборЗаписей[0];
    КонецЕсли;
    
    Запись.Статус = НовыйСтатус;
    Запись.ДатаИзменения = ТекущаяДата();
    
    Если НовыйСтатус = Перечисления.СтатусАбонемента.Заморожен Тогда
        Запись.ДоступноЗаморозок = Макс(0, Запись.ДоступноЗаморозок - 1);
    ИначеЕсли НовыйСтатус = Перечисления.СтатусАбонемента.Активен Тогда
        Запись.ДоступноЗаморозок = Запись.ДоступноЗаморозок + 1;
    КонецЕсли;
    
    НаборЗаписей.Записать();
    
КонецПроцедуры
